// 1) Создайте произвольный массив чисел.Используя цикл for обойдите этот массив и выведите в консоль только четные числа.
// // 2) Создайте массив из всех цветов радуги.Используя цикл for обойдите этот массив и
//  выведите в консоль все цвета радуги, но в обратном порядке, p.s.обратите внимание 
//  на индексы массивов и стартовую позицию для i.

// ============================1======================================

const ponies = [1, 2, 3, 4, 5, 6]

for (let i = 0; i < [4]; i++) {
    console.log(ponies[i])
}

console.log('||||')
// ============================2======================================

const rainbow = ["красный", "оранжевый", "жёлтый", "зелёный", "голубой", "синий", "фиолетовый"]

for(i = rainbow.length - 1; i >= 0 ; i--) {
    console.log(rainbow[i])
}

